{
  "_name_or_path": "AutoTrain",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Ankle boot",
    "1": "Bag",
    "2": "Coat",
    "3": "Dress",
    "4": "Pullover",
    "5": "Sandal",
    "6": "Shirt",
    "7": "Sneaker",
    "8": "T - shirt / top",
    "9": "Trouser"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Ankle boot": "0",
    "Bag": "1",
    "Coat": "2",
    "Dress": "3",
    "Pullover": "4",
    "Sandal": "5",
    "Shirt": "6",
    "Sneaker": "7",
    "T - shirt / top": "8",
    "Trouser": "9"
  },
  "layer_norm_eps": 1e-12,
  "max_length": 128,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "padding": "max_length",
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.20.0"
}
